docs/phases/uap-warmups-the-power-of-a-good-warmup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Power of a good Warmup</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../static/common.css" />
<link rel="stylesheet" type="text/css" href="../static/workout.css" />
<link rel="icon" type="image/ico" href="../static/dumbell.ico" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="uap-warmups.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">The Power of a good Warmup
<br />
<span class="subtitle">uap-warmups</span>
</h1>
<p>
The UAP has such strong programming&#x2026;it would be a shame to not get all the benefits you can from following it! I'm a strong believer in the power of a short warm up specific to the movement you're going to be doing - you want great range of motion, less stress on your joints and the right musculature working during your session. Rolling on a foam roller for a couple minutes and then jumping into training is not your best bet - here's a breakdown of what I consider to be the best bang-for-your-buck warm up movements for some of the different program days! :)
</p>

<p>
First of all, I can't recommend <a href="https://www.youtube.com/embed/2S3Y1PSrVJU">lacrosse balls</a> <a href="https://img.youtube.com/vi/2S3Y1PSrVJU">lacrosse balls/hqdefault.jpg</a> enough&#x2026;you don't need to hit every point in your body, but spend a couple minutes targeting the places you're tight, in addition to musculature you're going to be using that day. Do this before doing mobility/activation work! If you're naturally mobile in a certain area (ankles, hips) you can totally skip those mobility exercises and shorten your warm up.
</p>

<div id="outline-container-orgc07f9c2" class="outline-2">
<h2 id="orgc07f9c2">Upper</h2>
<div class="outline-text-2" id="text-orgc07f9c2">
<p>
<b>Mobility:</b> <b>shoulders, mid-back</b>
</p>

<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=tl9TBVxWS6A">Band Pull</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=tl9TBVxWS6A">Band Pull/hqdefault.jpg</a>
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/LyWVNOfEnCc">Mid-Back Mobility</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/LyWVNOfEnCc">Mid-Back Mobility/hqdefault.jpg</a>
</p>

<p>
<b>Activation: core</b>
</p>

<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=z_Edc-R8EVU">Crawling</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=z_Edc-R8EVU">Crawling/hqdefault.jpg</a>
</p>
</div>
</div>

<div id="outline-container-org2c12ae7" class="outline-2">
<h2 id="org2c12ae7">SAQ</h2>
<div class="outline-text-2" id="text-org2c12ae7">
<p>
<b>Mobility: *hips, ankles</b>
</p>

<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=LRLAqL6blT0">Frog Stretch</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=LRLAqL6blT0">Frog Stretch/hqdefault.jpg</a> (hips)
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/Bqt_R2HX6KQ">Ankle Mobility</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/Bqt_R2HX6KQ">Ankle Mobility/hqdefault.jpg</a>
</p>

<p>
<b>Activation: glutes, core</b>
</p>

<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=wdbl1tmmm4E">Circle Band</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=wdbl1tmmm4E">Circle Band/hqdefault.jpg</a> (glutes)
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=z_Edc-R8EVU">Crawling</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=z_Edc-R8EVU">Crawling/hqdefault.jpg</a> (core)
</p>
</div>
</div>

<div id="outline-container-org0b95d2d" class="outline-2">
<h2 id="org0b95d2d">Lower</h2>
<div class="outline-text-2" id="text-org0b95d2d">
<p>
<b>Mobility: hips, ankles, shoulders</b>
</p>

<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=LRLAqL6blT0">Frog Stretch</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=LRLAqL6blT0">Frog Stretch/hqdefault.jpg</a> (hips)
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/Bqt_R2HX6KQ">Ankle Mobility</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/Bqt_R2HX6KQ">Ankle Mobility/hqdefault.jpg</a>
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=tl9TBVxWS6A">Band Pull</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=tl9TBVxWS6A">Band Pull/hqdefault.jpg</a>
</p>

<p>
<b>Activation: glutes, core</b>
</p>

<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=OszMdC2rPf8">Running Man</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=OszMdC2rPf8">Running Man/hqdefault.jpg</a> (glutes)
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=z_Edc-R8EVU">Crawling</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=z_Edc-R8EVU">Crawling/hqdefault.jpg</a> (core)
</p>
</div>
</div>

<div id="outline-container-org9735306" class="outline-2">
<h2 id="org9735306">Core</h2>
<div class="outline-text-2" id="text-org9735306">
<p>
<b>Mobility: mid-back, shoulders, hips</b>
</p>

<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/LyWVNOfEnCc">Mid-Back Mobility</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/LyWVNOfEnCc">Mid-Back Mobility/hqdefault.jpg</a>
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=tl9TBVxWS6A">Band Pull</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=tl9TBVxWS6A">Band Pull/hqdefault.jpg</a>
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=LRLAqL6blT0">Frog Stretch</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=LRLAqL6blT0">Frog Stretch/hqdefault.jpg</a> (hips)
</p>

<p>
<b>Activation: core</b>
</p>

<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=z_Edc-R8EVU">Crawling</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=z_Edc-R8EVU">Crawling/hqdefault.jpg</a>
</p>
</div>
</div>

<div id="outline-container-orga98d6fc" class="outline-2">
<h2 id="orga98d6fc">Full Body</h2>
<div class="outline-text-2" id="text-orga98d6fc">
<p>
<b>Mobility: hips, mid-back</b>
</p>

<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=LRLAqL6blT0">Frog Stretch</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=LRLAqL6blT0">Frog Stretch/hqdefault.jpg</a> (hips)
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/LyWVNOfEnCc">Mid-Back Mobility</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/LyWVNOfEnCc">Mid-Back Mobility/hqdefault.jpg</a>
</p>

<p>
<b>Activation: glutes, core</b>
</p>

<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=OszMdC2rPf8">Running Man</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=OszMdC2rPf8">Running Man/hqdefault.jpg</a> (glute activation)
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=z_Edc-R8EVU">Crawling</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=z_Edc-R8EVU">Crawling/hqdefault.jpg</a> (core)
</p>
</div>
</div>

<div id="outline-container-org01f33a6" class="outline-2">
<h2 id="org01f33a6">Conditioning</h2>
<div class="outline-text-2" id="text-org01f33a6">
<p>
<b>Mobility: hips, ankle, shoulders</b>
</p>

<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=LRLAqL6blT0">Frog Stretch</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=LRLAqL6blT0">Frog Stretch/hqdefault.jpg</a> (hips)
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/Bqt_R2HX6KQ">Ankle Mobility</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/Bqt_R2HX6KQ">Ankle Mobility/hqdefault.jpg</a>
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=tl9TBVxWS6A">Band Pull</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=tl9TBVxWS6A">Band Pull/hqdefault.jpg</a>
</p>

<p>
<b>Activation: glutes, core</b>
</p>

<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=wdbl1tmmm4E">Circle Band</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=wdbl1tmmm4E">Circle Band/hqdefault.jpg</a> (glutes)
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/embed/watch?v=z_Edc-R8EVU">Crawling</a></li>
</ul>
<p>
<a href="https://img.youtube.com/vi/watch?v=z_Edc-R8EVU">Crawling/hqdefault.jpg</a> (core)
</p>

<p>
Just a few minutes at the beginning of your time at the gym/on the field can make all the difference - add a thoughtful warm up to the thoughtful programming and you're WINNING. :)
</p>
<p>
*
    Have a question? Send it to [<a href="file:///c:/cdn-cgi/l/email-protection">email protected</a>]{._<sub>cf</sub><sub>email</sub>__} with the subject line "The Knowledge!"
</p>
</div>
</div>
</div>
</body>
</html>
